ben/blog/2025-10-05-identifying-essentials.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>How to Identify Essentials</title>
<meta name="author" content="Ben" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">How to Identify Essentials</h1>
<p><strong>Tags:</strong> <span class="tags"><a href="tags/philosophy.html">philosophy</a></span></p>

<p>
Ask yourself the following questions when evaluating if something is essential:
</p>
<ol class="org-ol">
<li>What are your values? The principles you live by.</li>
<li>What are your goals? Short and long term. What do you want to achieve in life?</li>
<li>What do you love? Who do you love spending time with?</li>
<li>What is important to you? In life, in work, etc</li>
<li>What has the biggest impact? When choosing between projects</li>
<li>What has the most long term impact?</li>
<li>Needs vs wants. Most wants can be eliminated</li>
<li>Eliminate the nonessential - work backward eliminating the nonessential first, what's left is more essential. May take several passes</li>
<li>Keep editing - things change, so will your essentials list. Don't keep doing something that has become nonessential. Make a first pass, come back in a week and make another pass, keep doing this until you're happy you only have essential work</li>
</ol>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2025-10-05</p>
<p class="author">Author: Ben</p>
</div>
</body>
</html>
